app/controllers/users_controller.rb

INSERT INTO "users" ("avatar", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["avatar", "DSCN0296.JPG"], ["created_at", Thu, 17 Apr 2014 02:57:24 UTC +00:00], ["name", "test"], ["updated_at", Thu, 17 Apr 2014 02:57:24 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "avatar" = 'DSCN0296.JPG', "updated_at" = '2014-04-17 03:04:16.629977' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])